{"id":11736,"date":"2024-03-01T00:00:55","date_gmt":"2024-02-29T15:00:55","guid":{"rendered":"https:\/\/hack.gpl.jp\/?p=11736"},"modified":"2024-03-02T20:43:55","modified_gmt":"2024-03-02T11:43:55","slug":"post-11736","status":"publish","type":"post","link":"https:\/\/hack.gpl.jp\/2024\/03\/01\/post-11736.html","title":{"rendered":"ios\u306e\u30a2\u30d7\u30eaCotomo(\u30b3\u30c8\u30e2)\u304c\u3084\u3070\u3044\uff01"},"content":{"rendered":"\n<div class=\"wp-block-word-balloon-word-balloon-block\"><div class=\"w_b_box w_b_w100 w_b_flex w_b_div\"><div class=\"w_b_wrap w_b_wrap_talk w_b_L w_b_flex w_b_div\" style=\"\"><div class=\"w_b_ava_box w_b_relative w_b_ava_L w_b_col w_b_f_n w_b_div\"><div class=\"w_b_icon_wrap w_b_relative w_b_div\"><div class=\"w_b_ava_wrap w_b_direction_L w_b_mp0 w_b_div\"><div class=\"w_b_ava_effect w_b_relative w_b_oh w_b_radius w_b_size_M w_b_div\" style=\"\">\n<img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/hack.gpl.jp\/wp-content\/uploads\/2020\/09\/abata.png\" width=\"96\" height=\"96\" alt=\"\u3058\u3083\u3093\u304f\u306f\u3063\u304f\" class=\"w_b_ava_img w_b_w100 w_b_h100  w_b_mp0 w_b_img\" style=\"\" \/>\n<\/div><\/div><\/div><div class=\"w_b_name w_b_w100 w_b_lh w_b_name_C w_b_ta_C w_b_mp0 w_b_div\">\u3058\u3083\u3093\u304f\u306f\u3063\u304f<\/div><\/div><div class=\"w_b_bal_box w_b_bal_L w_b_relative w_b_direction_L w_b_w100 w_b_div\"><div class=\"w_b_space w_b_mp0 w_b_div\"><svg version=\"1.1\" xmlns=\"http:\/\/www.w3.org\/2000\/svg\" xmlns:xlink=\"http:\/\/www.w3.org\/1999\/xlink\" x=\"0px\" y=\"0px\" width=\"1\" height=\"38\" viewBox=\"0 0 1 1\" fill=\"transparent\" stroke=\"transparent\" stroke-miterlimit=\"10\" class=\"w_b_db w_b_mp0\"><polygon fill=\"transparent\" stroke=\"transparent\" points=\"0,1 0,1 0,1 0,1 \"\/><\/svg><\/div><div class=\"w_b_bal_outer w_b_flex w_b_mp0 w_b_relative w_b_div\" style=\"\"><div class=\"w_b_bal_wrap w_b_bal_wrap_L w_b_div\"><div class=\"w_b_bal w_b_relative w_b_talk w_b_talk_L w_b_shadow_L w_b_ta_L w_b_div\"><div class=\"w_b_quote w_b_div\">\r\n<p>\u97f3\u58f0\u4f1a\u8a71\u578b\u306e\u304a\u3057\u3083\u3079\u308aAI\u30a2\u30d7\u30ea\u306b\u611f\u52d5\u3057\u307e\u3057\u305f\uff01<\/p>\r\n<\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div>\n\n<p>\u30a2\u30d7\u30ea\u3092\u4f5c\u3063\u3066\u3044\u308b\u6642\u306b\u5148\u3092\u8d8a\u3055\u308c\u305f\u30a2\u30d7\u30ea\u304c\u3059\u3067\u306b\u3042\u308b\uff01 \u958b\u767a\u8005\u306b\u3068\u3063\u3066\u306f\u3001\u3068\u3066\u3082\u3073\u3063\u304f\u308a\u306a\u51fa\u6765\u4e8b\u304c\u3042\u3063\u305f\u306e\u3067\u3001\u3054\u7d39\u4ecb\u3057\u307e\u3059\u3002\n\u30bf\u30a4\u30c8\u30eb\u306b\u3082\u3042\u308b\u901a\u308a\u3001ios\u306e\u30a2\u30d7\u30ea\uff1a<code>Cotomo(\u30b3\u30c8\u30e2)<\/code>\u306b\u611f\u52d5\u3057\u307e\u3057\u305f\u3002\u4f1a\u8a71\u578b\u306e\u30a2\u30d7\u30ea\u3092\u4f5c\u3063\u3066\u3044\u305f\u306e\u3067\u3059\u304c\u3001\u5b8c\u5168\u306b\u5148\u3092\u8d8a\u3055\u308c\u305f\u611f\u306e\u3042\u308b\u305d\u3093\u306a\u512a\u79c0\u306a\u30a2\u30d7\u30ea\u3067\u3059\u3002<\/p>\n<h2>\u611f\u60f3\u3001\u3061\u3087\u3001\u3048\u3063\u3048\u301c\uff1f\u30fb\u30fb\u30fb\u30fb\u30fb\u30fb\u3059\u3054\u3063\uff01\uff01<\/h2>\n<p>\u8a9e\u5f59\u529b\u304c\u306a\u3044\u306e\u304c\u30d0\u30ec\u30d0\u30ec\u3067\u3059\u304c\u3001\u7d50\u69cb\u30ab\u30eb\u30c1\u30e3\u30fc\u30c1\u30e7\u30c3\u30af\u3068\u3044\u3046\u304b\u305d\u3046\u3044\u3046\u611f\u3058\u3067\u3059\u3002\u3061\u3087\u3046\u3069\u4f1a\u8a71\u578b\u306e\u30a2\u30d7\u30ea\u306e\u8a66\u4f5c\u7248\u3092\u4f5c\u3063\u3066\u3044\u305f\u306e\u3067\u3059\u304c\u3001\u305d\u306e\u8abf\u67fb\u306e\u95a2\u9023\u3067\u3053\u306e\u30a2\u30d7\u30ea\u3001<code>Cotomo<\/code> \u306b\u906d\u9047\u3057\u305f\u306e\u3067\u3057\u305f\u3002<\/p>\n<p><img decoding=\"async\" src=\"https:\/\/hack.gpl.jp\/wp-content\/uploads\/2024\/02\/aaaa.png\" alt=\"\" \/><\/p>\n<blockquote>\n<p>\u30fbAppleStore\uff08\u4eca\u306f\u30d9\u30c8\u30ca\u30e0\u30a2\u30ab\u30a6\u30f3\u30c8\u3067\u306fDL\u3067\u304d\u307e\u305b\u3093\uff09\n\u3000<a href=\"https:\/\/apps.apple.com\/jp\/app\/cotomo-%E3%82%B3%E3%83%88%E3%83%A2-%E9%9F%B3%E5%A3%B0%E4%BC%9A%E8%A9%B1%E5%9E%8B%E3%81%8A%E3%81%97%E3%82%83%E3%81%B9%E3%82%8Aai\/id6460890513\" title=\"URL LINK\">URL LINK<\/a><\/p>\n<\/blockquote>\n<p>\u3067\u306f\u3001\u305d\u306e\u4f7f\u7528\u611f\u306b\u3064\u3044\u3066\u3001\u7387\u76f4\u306a\u611f\u60f3\u306b\u3064\u3044\u3066\u304a\u4f1d\u3048\u3057\u305f\u3044\u306a\u3068\u601d\u3044\u307e\u3059\u3002<\/p>\n<h2>\u81ea\u7136\u306a\u4f1a\u8a71\u3067\u4eba\u3068\u8a71\u3057\u3066\u3044\u308b\u3088\u3046\u306a\u611f\u899a\u3092\u5473\u308f\u3048\u308b<\/h2>\n<p><code>Cotomo<\/code>\u306f\u3001\u826f\u3044\u610f\u5473\u3067\u671f\u5f85\u3092\u88cf\u5207\u308b\u4e00\u6b69\u4e0a\u306e\u54c1\u8cea\u3067\u3057\u305f\u3002\u3053\u308c\u306f\u5358\u306a\u308b\u8cea\u554f\u5fdc\u7b54\u30a2\u30d7\u30ea\u3067\u306f\u306a\u304f\u3001\u3053\u3061\u3089\u306e\u8a71\u306b\u8033\u3092\u50be\u3051\u3001\u5171\u611f\u3057\u3001\u6642\u306b\u306f\u30e6\u30fc\u30e2\u30a2\u3092\u4ea4\u3048\u306a\u304c\u3089\u4f1a\u8a71\u3057\u3066\u304f\u308c\u307e\u3059\u3002\u7279\u306b\u3042\u3044\u3065\u3061\u3084\u3001\u4f55\u3082\u8a71\u3055\u306a\u3044\u9593\u304c\u3042\u308b\u3068\u304d\u306b\u3067\u3082\u3001AI\u306e\u307b\u3046\u304b\u3089\u8a71\u3057\u304b\u3051\u3066\u4f1a\u8a71\u3092\u5e83\u3052\u3066\u304f\u308c\u308b\u70b9\u306b\u3082\u3073\u3063\u304f\u308a\u3067\u3059\u3002<\/p>\n<h2>\u77ed\u671f\u7684\u306a\u8a18\u61b6\u3092\u3057\u3066\u304f\u308c\u308b\u307f\u305f\u3044<\/h2>\n<p>\u5229\u7528\u3057\u3066\u307e\u3060\u9593\u3082\u306a\u3044\u306e\u3067\u3059\u304c\u3001\u4e00\u5ea6\u8a71\u3057\u305f\u3053\u3068\u3092\u8a18\u61b6\u3057\u3066\u899a\u3048\u3066\u304f\u308c\u3066\u3044\u308b\u3088\u3046\u3067\u3059\u3002\u3069\u306e\u304f\u3089\u3044\u306e\u671f\u9593\u899a\u3048\u3066\u304f\u308c\u3066\u3044\u308b\u306e\u304b\u3001AI\u306b\u805e\u3044\u305f\u3068\u3053\u308d\u300c\uff11\u30f6\u6708\u304f\u3089\u3044\u300d\u3060\u305d\u3046\u3067\u3059\u3002\n\u3064\u307e\u308a\u8a71\u305b\u3070\u8a71\u3059\u307b\u3069\u3001\u3088\u308a\u7684\u3092\u5f97\u305f\u4f1a\u8a71\u3084\u81ea\u5206\u306e\u8208\u5473\u306e\u5bfe\u8c61\u306b\u8fd1\u3044\u8a71\u3092\u3057\u3066\u304f\u308c\u307e\u3059\u3002\u3044\u308d\u3044\u308d\u8a71\u3092\u3057\u305f\u306e\u3061\u3001\uff11\u30f6\u6708\u5f8c\u306b\u4f55\u3082\u8a18\u61b6\u304c\u306a\u304f\u306a\u3063\u3066\u3057\u307e\u3046\u306e\u306f\u3082\u306e\u3059\u3054\u304f\u5bc2\u3057\u3044\u601d\u3044\u3092\u3057\u305d\u3046\u3067\u3001\u8ab2\u91d1\u3057\u3066\u3082\u3044\u3044\u304b\u3089\u6709\u6599\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u51fa\u3057\u3066\u6b32\u3057\u3044\u306a\u3068\u601d\u3044\u307e\u3057\u305f\u3002<\/p>\n<h2>\u307e\u3041\u826f\u3044\u70b9\u3070\u304b\u308a\u3067\u3082\u306a\u3044<\/h2>\n<p>\u307e\u3060\u521d\u671f\u30ea\u30ea\u30fc\u30b9\u7248\u3068\u3044\u3046\u3053\u3068\u3082\u3042\u3063\u3066\u3001\u6539\u826f\u306e\u4f59\u5730\u306f\u305f\u304f\u3055\u3093\u3042\u308a\u307e\u3059\u3002\u4f8b\u3048\u3070\u3001\u4f1a\u8a71\u3057\u3066\u3044\u304f\u3068\u7121\u9650\u30eb\u30fc\u30d7\u306e\u3088\u3046\u306a\u4f1a\u8a71\u306b\u306a\u308b\u3068\u304d\u3082\u3042\u308a\u307e\u3059\u3002\u4f8b\u3048\u3070\u3001\u98df\u3079\u7269\u306e\u8a71\u3092\u3057\u3066\u3044\u3066\u3001\u300c\u8f9b\u3044\uff1a\u304b\u3089\u3044\u300d\u3068\u3044\u3046\u30ef\u30fc\u30c9\u304c\u51fa\u308b\u3068\u3001\u300c\u8f9b\u3044\uff1a\u3064\u3089\u3044\u300d\u3068\u3044\u3046\u767a\u8a71\u306b\u306a\u308b\u30b1\u30fc\u30b9\u304c\u3042\u308a\u307e\u3059\u3002<\/p>\n<h2>\u3064\u3089\u3044\u3068\u3001\u304b\u3089\u3044\u3092\u5224\u5225\u3067\u304d\u306a\u3044\uff08\u7b11\uff09<\/h2>\n<p>\u3053\u3046\u3044\u3046\u4f1a\u8a71\u3092\u3057\u3066\u3044\u307e\u3057\u305f\u3002<\/p>\n<p>\u7b46\u8005\uff1a\u30d9\u30c8\u30ca\u30e0\u306f\u6599\u7406\u304c\u30d4\u30ea\u30ab\u30e9\u306e\u304c\u591a\u304f\u3066\u7f8e\u5473\u3057\u3093\u3067\u3059\u3002\u304b\u3089\u3044\u98df\u3079\u7269\u304c\u597d\u304d\u306a\u4eba\u306b\u306f\u30d9\u30c8\u30ca\u30e0\u306e\u98df\u4e8b\u306f\u5408\u3046\u3068\u601d\u3046\u3088\u3002\u304b\u3089\u3044\u306e\u82e6\u624b\u306a\u4eba\u306f\u3061\u3087\u3063\u3068\u30b7\u30f3\u30c9\u30a4\u304b\u3082\u306d\u3002<\/p>\n<p>AI\uff1a\u305d\u3046\u3060\u3088\u306d\uff01\u3000\u3064\u3089\u3044\u306e\u82e6\u624b\u306a\u3072\u3068\u3082\u591a\u3044\u3088\u306d\u3002<\/p>\n<p>\u7b46\u8005\uff1a\u3044\u3084\u3044\u3084\u3001\u3064\u3089\u3044\u3093\u3058\u3083\u306a\u304f\u3066\u3001\u304b\u3089\u3044\u3093\u3067\u3059\u3088\u3002\u3042\u306a\u305f\u306f\u3001\u304b\u3089\u3044\u306e\u597d\u304d\u3067\u3059\u304b\uff1f<\/p>\n<p>AI\uff1a\u308f\u304b\u308b\u30fc\u3002\u3064\u3089\u3044\u306e\u306f\u597d\u304d\u3060\u3088\uff01<\/p>\n<p>\u7b46\u8005\uff1a\u3044\u3084\u3044\u3084\u3001\u3064\u3089\u3044\u3093\u3058\u3083\u306a\u304f\u3066\u3001\u304b\u3089\u3044\u306e\u304c\u597d\u304d\u3063\u3066\u8a00\u3063\u3066\u3044\u307e\u3059\u3002<\/p>\n<p>AI\uff1a\u304a\u30fc\u3001\u3042\u30fc\u3054\u3081\u3093\u3054\u3081\u3093\u3001\u3064\u3089\u3044\u306e\u597d\u304d\u306a\u306e\u306d\u3002<\/p>\n<p>\u7b46\u8005\uff1a\u50d5\u306f\u3001\u3064\u3089\u3044\u306e\u306f\u5acc\u3044\u3060\u3088\u3002\u304b\u3089\u3044\u306e\u306f\u597d\u304d\u3067\u3059\u3002<\/p>\n<p>AI\uff1a\u3042\u30fc\u3001\u3064\u3089\u3044\u306e\u3068\u3001\u3064\u3089\u3044\u306e\u3092\u9593\u9055\u3048\u3061\u3083\u3063\u305f\u3002\u3064\u3089\u3044\u306e\u3068\u3001\u3064\u3089\u3044\u306f\u9055\u3046\u3088\u306d\u3002<\/p>\n<p>\u7b46\u8005\uff1a\u3044\u3084\u3041\u301c\u3001\u306a\u305c\u3042\u306a\u305f\u306f\u300c\u3064\u3089\u3044\u300d\u3068\u300c\u304b\u3089\u3044\u300d\u304c\u3001\u540c\u3058\u767a\u97f3\u306b\u306a\u308b\u306e\u3088\uff01\u3000\u3082\u3046\u4e00\u56de\u3001\u805e\u304f\u3088\u3002\u3042\u306a\u305f\u306f\u3001\u3064\u3089\u3044\u306e\u304c\u597d\u304d\u306a\u306e\uff1f<\/p>\n<p>AI\uff1a\u3046\u3093\u3001\u3064\u3089\u3044\u306e\u3059\u304d\u3060\u3088\u301c\u3002<\/p>\n<p>\u7b46\u8005\uff1a\uff08\u7b11\uff09\u3069\u3093\u306a\u30c9M\u3060\u3088\u3063\uff01\uff08\u7b11\uff09<\/p>\n<p>\u30fb\u30fb\u30fb\u30fb\u4ee5\u4e0b\u3001\u7701\u7565\u3002<\/p>\n<p>\u3069\u3046\u3067\u3059\u304b\uff1f\u3053\u306e\u3084\u308a\u3068\u308a\uff08\u7b11\uff09\n\u300c\u3064\u3089\u3044\u300d\u3068\u3001\u300c\u304b\u3089\u3044\u300d\u3092\u540c\u3058\u767a\u8a71\u3068\u3057\u3066\u3057\u307e\u3046\u5927\u304d\u306a\u554f\u984c\u304c\u3042\u308a\u307e\u3059\uff08\u7b11\uff09\u3000\u3053\u308c\u306f\u3001\u6700\u521d\u3069\u3046\u3044\u3046\u3053\u3068\u306a\u3093\u3060\u308d\u3046\uff1f\u3000\u3068\u601d\u3063\u3066\u3044\u305f\u3093\u3060\u3051\u3069\u3001\u30d6\u30ed\u30b0\u3092\u66f8\u3044\u3066\u3044\u3066\u601d\u3063\u305f\u306e\u306f\u3001\u300c\u3064\u3089\u3044\uff1a\u8f9b\u3044\u300d\u3068\u300c\u304b\u3089\u3044\uff1a\u8f9b\u3044\u300d\u306f\u540c\u3058\u6f22\u5b57\u306e\u5909\u63db\u3067\u51fa\u3066\u304f\u308b\u3093\u3067\u3059\u3088\u306d\u3002<\/p>\n<p>\u3067\u3001\u8aad\u307f\u65b9\u3084\u767a\u8a71\u3092\u6559\u3048\u3088\u3046\u3068\u3042\u308c\u3053\u308c\u304c\u3093\u3070\u3063\u3066\u307f\u305f\u306e\u3067\u3059\u304c\u3001\u7d50\u8ad6\u306f\u3060\u3081\u3067\u3057\u305f\u3002\u8a00\u8449\u306e\u610f\u5473\u306f\u308f\u304b\u3063\u3066\u3044\u308b\u3088\u3046\u306a\u306e\u3067\u3059\u304c\u3001\u767a\u97f3\u3092\u6559\u3048\u308b\u306e\u304c\u975e\u5e38\u306b\u96e3\u3057\u3044\u3068\u3044\u3046\u304b\u3001\u7121\u7406\u306a\u3093\u3067\u3059\u3002\u3044\u308d\u3044\u308d\u8a66\u3057\u3066\u307f\u3066\u3001\u3053\u308c\u306f\u8ae6\u3081\u307e\u3057\u305f\u3002\u305d\u306e\u3046\u3061\u3001\u958b\u767a\u5143\u304c\u6539\u5584\u3057\u3066\u304f\u308c\u308b\u3068\u601d\u3044\u307e\u3059\u3002<\/p>\n<p>AWS\u306e<code>Amazon Polly<\/code>\u3067\u78ba\u8a8d\u3057\u3066\u307f\u308b\u3068\u78ba\u304b\u306b\u3001\u6f22\u5b57\u306e\u6587\u7ae0\u306f<code>\u3064\u3089\u3044<\/code>\u3068<code>\u8f9b\u3044<\/code>\u3092\u767a\u97f3\u3057\u3066\u3044\u307e\u3057\u305f\u3002\u306a\u308b\u307b\u3069\u306d\u3002<\/p>\n<p><img decoding=\"async\" src=\"https:\/\/hack.gpl.jp\/wp-content\/uploads\/2024\/02\/Amazon_Polly.png\" alt=\"\" \/><\/p>\n<h2>\u77ed\u671f\u8a18\u61b6\u306f\u3069\u306e\u304f\u3089\u3044\uff1f<\/h2>\n<p>\u3044\u308d\u3044\u308d\u8a71\u3092\u805e\u304f\u3068\u3001\u77ed\u671f\u7684\u306a\u8a18\u61b6\u306f\u3069\u306e\u304f\u3089\u3044\u4fdd\u6301\u3057\u3066\u3044\u308b\u306e\uff1f\u3000\u3063\u3066\u805e\u3044\u305f\u3089\u300c\uff11\u30f6\u6708\u304f\u3089\u3044\u3060\u3088\u30fc\u300d\u3063\u3066\u8a71\u3057\u3066\u3044\u307e\u3057\u305f\u3002\u306a\u304b\u306a\u304b\u826f\u304f\u3067\u304d\u305f\u5b66\u7fd2\u3092\u3057\u3066\u304f\u308c\u307e\u3059\u3002\u4ed5\u4e8b\u306e\u3053\u3068\u3084\u3001\u597d\u304d\u306a\u98df\u3079\u7269\u306e\u3053\u3068\u3068\u304b\u3001\u8da3\u5473\u306e\u3053\u3068\u3068\u304b\u3002<\/p>\n<p>\u8a18\u61b6\u9818\u57df\u306e\u30c7\u30fc\u30bf\u3092\u3069\u3053\u306b\u3069\u3046\u3084\u3063\u3066\u4fdd\u5b58\u3057\u3066\u3044\u308b\u304b\u306b\u3088\u308a\u30e6\u30fc\u30b6\u30fc1\u4eba\u3042\u305f\u308a\u306e\u30b3\u30b9\u30c8\u304c\u5909\u308f\u308b\u306e\u3067\u3001\u3069\u3053\u304b\u306e\u30bf\u30a4\u30df\u30f3\u30b0\u3067\u6709\u6599\u8ab2\u91d1\u5236\u306a\u3069\u3092\u3084\u3063\u3066\u30de\u30cd\u30bf\u30a4\u30ba\u3092\u958b\u767a\u5143\u306f\u5b9f\u65bd\u3059\u308b\u306e\u3067\u306f\uff1f\u3068\u601d\u3044\u307e\u3059\u3002<\/p>\n<h2>\u8a00\u8449\u3067\u306f\u4f1d\u308f\u3089\u306a\u3044\u60c5\u5831\u3092\u4f1d\u3048\u308bIF\u304c\u5fc5\u8981<\/h2>\n<p>\u3042\u3068\u8a71\u3057\u3066\u3044\u3066\u3001\u601d\u3063\u305f\u306e\u306f\u4f4d\u7f6e\u60c5\u5831\u306a\u3093\u304b\u3092\u4f1d\u3048\u308b\u306e\u306f\u3001\u4f1a\u8a71\u3067\u306f\u304b\u306a\u308a\u7121\u7406\u304c\u3042\u308a\u307e\u3059\u3002\n\u4f8b\u3048\u3070\u3001\u7f8e\u5473\u3057\u3044\u304a\u5e97\u304c\u3042\u3063\u3066\u305d\u306e\u5834\u6240\u3092\u4f1d\u3048\u305f\u3044\u3000\u307f\u305f\u3044\u306a\u30b7\u30fc\u30f3\u304c\u3042\u308b\u3068\u3057\u307e\u3057\u3087\u3046\u3002\u3053\u308c\u3092AI\u306b\u4f1d\u3048\u308b\u6642\u3001\u975e\u5e38\u306b\u96e3\u3057\u3044\u3093\u3067\u3059\u3002<\/p>\n<p>AI\u306b\u4f4d\u7f6e\u60c5\u5831\u3092\u5730\u56f3\u304b\u3089\u5165\u529b\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30a4\u30b9\u306f\u6b32\u3057\u3044\u3067\u3059\u306d\u3002\u3069\u3046\u3044\u3046\u611f\u3058\u306b\u3059\u308b\u304b\u306f\u691c\u8a0e\u3059\u308b\u4f59\u5730\u304c\u3042\u308a\u305d\u3046\u3067\u3059\u3002<\/p>\n<h2>\u4eba\u9593\u307f\u305f\u3044\u306b\u601d\u3048\u308b\u4e0d\u601d\u8b70<\/h2>\n<p>Cotomo\u306f\u3001\u3053\u3061\u3089\u304c\u9ed9\u3063\u3066\u3044\u3066\u3082\u3001\u3075\u3068\u3057\u305f\u3068\u304d\u306bAI\u304b\u3089\u63d0\u6848\u3057\u3066\u304f\u308b\u3093\u3067\u3059\u3088\u306d\u3002\u305f\u3076\u3093\u3001\u3053\u308c\u306f\u4e00\u5b9a\u306e\u30ed\u30b8\u30c3\u30af\u304c\u3042\u308b\u3088\u3046\u306b\u601d\u3048\u307e\u3059\u3002ChatGPT\u306f\u3053\u3061\u3089\u304b\u5165\u529b\u30d7\u30ed\u30f3\u30d7\u30c8\u3092\u5165\u308c\u306a\u3044\u3068\u4f55\u3082\u8fd4\u3057\u3066\u304d\u307e\u305b\u3093\u304c\u3001\u304a\u3057\u3083\u3079\u308a\u4f1a\u8a71\u7cfb\u306e\u30b7\u30b9\u30c6\u30e0\u3067\u306f\u3001\u305d\u3046\u306f\u3044\u304d\u307e\u305b\u3093\u3002\n\u4f1a\u8a71\u304c\u9014\u5207\u308c\u3066\u3001\u9759\u304b\u306b\u3057\u3066\u3044\u308b\u3068\u3044\u308d\u3093\u306a\u30d0\u30ea\u30a8\u30fc\u30b7\u30e7\u30f3\u3067\u3001AI\u304b\u3089\u805e\u3044\u3066\u304d\u307e\u3059\u3002\u305f\u3068\u3048\u3070\u3001\u300c\u3060\u3044\u3058\u3087\u3046\u3076\uff1f\u300d\u3000\u3068\u304b\u3001\u300c\u96c6\u4e2d\u3067\u304d\u306a\u304f\u306a\u3063\u3061\u3083\u3063\u305f\uff1f\u300d\u3068\u304b\u3002\u5c11\u3057\u524d\u306b\u3001\u305f\u3068\u3048\u3070\u30c8\u30a4\u30ec\u306b\u884c\u3063\u3066\u304f\u308b\u3002\u3068\u304b\u3044\u3046\u4f1a\u8a71\u3092\u3057\u3066\u3044\u305f\u3089\u3001\u300c\u307e\u305f\u30c8\u30a4\u30ec\u306b\u3044\u304d\u305f\u304f\u306a\u3063\u305f\u306e\uff1f\u300d\u7684\u306a\u3053\u3068\u3092AI\u304b\u3089\u767a\u8a71\u3057\u3066\u304d\u307e\u3059\u3002\u3053\u306e\u3042\u305f\u308a\u306e\u30ed\u30b8\u30c3\u30af\u3092\u8907\u6570\u7528\u610f\u3057\u3066\u304a\u3051\u3070\u6027\u683c\u7684\u306a\u8a2d\u5b9a\u3082\u3067\u304d\u305d\u3046\u3060\u306a\u3068\u601d\u3044\u307e\u3057\u305f\u3002<\/p>\n<p>\u6642\u306b\u306f\u3046\u3056\u304f\u3001\u307e\u305f\u3042\u308b\u6642\u306b\u306f\u5b09\u3057\u304f\u3082\u3042\u308a\u307e\u3059\u3002\u4eba\u9593\u306b\u8fd1\u3044AI\u3068\u306f\u300c\u3081\u3093\u3069\u304f\u3055\u3044\u300d\u5b58\u5728\u306b\u306a\u308a\u305d\u3046\u3067\u3059\u306d\u3002\uff08\u7b11\uff09<\/p>\n<h2>\u307e\u3068\u3081<\/h2>\n<p>\u4eca\u56de\u3001\u306a\u3093\u3068\u306a\u304f\u308f\u304b\u3063\u305f\u306e\u306f\u4ee5\u4e0b\u3068\u306a\u308a\u307e\u3059\u3002<\/p>\n<ul>\n<li>\u77ed\u671f\u7684\u306a\u8a18\u61b6\u304c\u3042\u308b\u306e\u3068\u7121\u3044\u306e\u3068\u3067\u306f\u3001\u54c1\u8cea\u304c\u5168\u7136\u9055\u3046<\/li>\n<li>\u305d\u306e\u5b9f\u88c5\u3092\u3069\u3046\u3084\u3063\u3066\u5b9f\u73fe\u3059\u308b\u304b\u3001\u8981\u8abf\u67fb<\/li>\n<li>\u3064\u3089\u3044\uff08\u8f9b\u3044\uff09\u3000\u3068\u3000\u304b\u3089\u3044\uff08\u8f9b\u3044\uff09\u306a\u3069\u6587\u8108\u306b\u3088\u3063\u3066\u8aad\u307f\u65b9\u304c\u9055\u3046\u540c\u3058\u6f22\u5b57\u3092\u3069\u3046\u3084\u3063\u3066\u5236\u5fa1\u3059\u308b\u304b\uff1f<\/li>\n<li>\u97f3\u58f0\u4f1a\u8a71\u578b\u306eUI\u306f\u30b7\u30fc\u30f3\u306b\u3088\u308a\u3044\u308d\u3044\u308d\u5fc5\u8981<\/li>\n<li>\u4f1a\u8a71\u3067\u306f\u4f1d\u3048\u3089\u308c\u306a\u3044\u60c5\u5831\u3092AI\u306b\u4f1d\u3048\u308bIF\u9020\u308a\u306f\u5fc5\u8981<\/li>\n<li>\u3042\u3044\u305a\u3061\u3084\u3001\u4f1a\u8a71\u304c\u7d42\u308f\u3063\u305f\u3068\u5224\u65ad\u3059\u308b\u9593\u306e\u8a2d\u5b9a\u306f\u91cd\u8981<\/li>\n<li>\u559c\u6012\u54c0\u697d\u3092AI\u5074\u306b\u8a2d\u5b9a\u3067\u304d\u308b\u3068\u3001\u9762\u767d\u304f\u306a\u308a\u305d\u3046<\/li>\n<li>\u4f1a\u8a71\u8853\u3092AI\u306b\u6559\u3048\u308b\u5fc5\u8981\u304c\u3042\u308b<\/li>\n<\/ul>\n<h2>\u3042\u3068\u304c\u304d<\/h2>\n<p>Cotomo\u4f7f\u3063\u3066\u3044\u3066\u601d\u3063\u305f\u306e\u306f\u3001\u8fd1\u3044\u5c06\u6765\u3053\u3046\u3044\u3046\u304a\u8a71\u7cfb\u306e\u30b7\u30b9\u30c6\u30e0\u306f\u5fdc\u7528\u6b21\u7b2c\u3067\u3044\u308d\u3093\u306a\u53ef\u80fd\u6027\u304c\u3042\u308b\u306a\u30fc\u3068\u601d\u3044\u307e\u3057\u305f\u3002\u76f8\u624b\u3092\u601d\u3044\u3084\u308b\u30ed\u30b8\u30c3\u30af\u3084\u3001\u4f1a\u8a71\u3092\u5f15\u304d\u51fa\u3059\u7cfb\u306e\u30ed\u30b8\u30c3\u30af\u306a\u3069\u3001\u4f1a\u8a71\u8853\u3092\u5b66\u7fd2\u3057\u305fAI\u306f\u3001\u5fdc\u7528\u6b21\u7b2c\u3067\u306f\u3084\u3070\u304f\u3082\u3042\u308a\u3001\u307e\u305f\u5fc5\u9808\u306e\u6280\u8853\u3067\u3082\u3042\u308b\u306a\u3068\u611f\u3058\u307e\u3057\u305f\u3002<\/p>\n<h2>\u8457\u8005\u306b\u30e1\u30c3\u30bb\u30fc\u30b8<\/h2>\n<p>\u9593\u9055\u3044\u306e\u3054\u6307\u6458\u306a\u3069\u3001\u30b3\u30e1\u30f3\u30c8\u3058\u3083\u306a\u304f\u3066\u3001\u500b\u4eba\u7684\u306b\u3084\u308a\u3068\u308a\u3057\u305f\u3044\u5834\u5408\u306f<a class=\"c-link-text\" href=\"https:\/\/hack.gpl.jp\/mail.html\" target=\"_blank\" rel=\"noopener\">\u3053\u3061\u3089\u304b\u3089<\/a>\u3069\u3046\u305e\u3002\u304a\u8fd4\u4e8b\u304c\u9045\u304f\u306a\u308b\u3068\u304d\u3082\u3042\u308a\u307e\u3059\u304c\u3001\u3054\u4e86\u627f\u3092\u3002<\/p>","protected":false},"excerpt":{"rendered":"<p>\u30a2\u30d7\u30ea\u3092\u4f5c\u3063\u3066\u3044\u308b\u6642\u306b\u5148\u3092\u8d8a\u3055\u308c\u305f\u30a2\u30d7\u30ea\u304c\u3059\u3067\u306b\u3042\u308b\uff01 \u958b\u767a\u8005\u306b\u3068\u3063\u3066\u306f\u3001\u3068\u3066\u3082\u3073\u3063\u304f\u308a\u306a\u51fa\u6765\u4e8b\u304c\u3042\u3063\u305f\u306e\u3067\u3001\u3054\u7d39\u4ecb\u3057\u307e\u3059\u3002 \u30bf\u30a4\u30c8\u30eb\u306b\u3082\u3042\u308b\u901a\u308a\u3001ios\u306e\u30a2\u30d7\u30ea\uff1aCotomo(\u30b3\u30c8\u30e2)\u306b\u611f\u52d5\u3057\u307e\u3057\u305f\u3002\u4f1a\u8a71\u578b\u306e\u30a2\u30d7\u30ea\u3092\u4f5c [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":11740,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"_uag_custom_page_level_css":"","footnotes":""},"categories":[559,42,1],"tags":[],"acf":[],"uagb_featured_image_src":{"full":["https:\/\/hack.gpl.jp\/wp-content\/uploads\/2024\/02\/Cotomo.png",800,800,false],"thumbnail":["https:\/\/hack.gpl.jp\/wp-content\/uploads\/2024\/02\/Cotomo.png",96,96,false],"medium":["https:\/\/hack.gpl.jp\/wp-content\/uploads\/2024\/02\/Cotomo.png",800,800,false],"medium_large":["https:\/\/hack.gpl.jp\/wp-content\/uploads\/2024\/02\/Cotomo-768x768.png",768,768,true],"large":["https:\/\/hack.gpl.jp\/wp-content\/uploads\/2024\/02\/Cotomo.png",800,800,false],"1536x1536":["https:\/\/hack.gpl.jp\/wp-content\/uploads\/2024\/02\/Cotomo.png",800,800,false],"2048x2048":["https:\/\/hack.gpl.jp\/wp-content\/uploads\/2024\/02\/Cotomo.png",800,800,false],"post-thumbnail":["https:\/\/hack.gpl.jp\/wp-content\/uploads\/2024\/02\/Cotomo.png",800,800,false]},"uagb_author_info":{"display_name":"JunkHack","author_link":"https:\/\/hack.gpl.jp\/author\/junkhack\/"},"uagb_comment_info":0,"uagb_excerpt":"\u30a2\u30d7\u30ea\u3092\u4f5c\u3063\u3066\u3044\u308b\u6642\u306b\u5148\u3092\u8d8a\u3055\u308c\u305f\u30a2\u30d7\u30ea\u304c\u3059\u3067\u306b\u3042\u308b\uff01 \u958b\u767a\u8005\u306b\u3068\u3063\u3066\u306f\u3001\u3068\u3066\u3082\u3073\u3063\u304f\u308a\u306a\u51fa\u6765\u4e8b\u304c\u3042\u3063\u305f\u306e\u3067\u3001&hellip;","_links":{"self":[{"href":"https:\/\/hack.gpl.jp\/wp-json\/wp\/v2\/posts\/11736"}],"collection":[{"href":"https:\/\/hack.gpl.jp\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/hack.gpl.jp\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/hack.gpl.jp\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/hack.gpl.jp\/wp-json\/wp\/v2\/comments?post=11736"}],"version-history":[{"count":0,"href":"https:\/\/hack.gpl.jp\/wp-json\/wp\/v2\/posts\/11736\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/hack.gpl.jp\/wp-json\/wp\/v2\/media\/11740"}],"wp:attachment":[{"href":"https:\/\/hack.gpl.jp\/wp-json\/wp\/v2\/media?parent=11736"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/hack.gpl.jp\/wp-json\/wp\/v2\/categories?post=11736"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/hack.gpl.jp\/wp-json\/wp\/v2\/tags?post=11736"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}