{"id":11771,"date":"2024-10-29T02:09:45","date_gmt":"2024-10-28T17:09:45","guid":{"rendered":"https:\/\/hack.gpl.jp\/?p=11771"},"modified":"2024-10-29T02:09:45","modified_gmt":"2024-10-28T17:09:45","slug":"post-11771","status":"publish","type":"post","link":"https:\/\/hack.gpl.jp\/2024\/10\/29\/post-11771\/","title":{"rendered":"AI\u306b\u81ea\u7136\u8a00\u8a9e\u3060\u3051\u3067Next.js\u3067macOS\u30af\u30ed\u30fc\u30f3\u96fb\u5353\u3092\u4f5c\u3063\u3066\u307f\u305f"},"content":{"rendered":"\n<div class=\"wp-block-word-balloon-word-balloon-block\"><div class=\"w_b_box w_b_w100 w_b_flex w_b_div\"><div class=\"w_b_wrap w_b_wrap_talk w_b_L w_b_flex w_b_div\" style=\"\"><div class=\"w_b_ava_box w_b_relative w_b_ava_L w_b_col w_b_f_n w_b_div\"><div class=\"w_b_icon_wrap w_b_relative w_b_div\"><div class=\"w_b_ava_wrap w_b_direction_L w_b_mp0 w_b_div\"><div class=\"w_b_ava_effect w_b_relative w_b_oh w_b_radius w_b_size_M w_b_div\" style=\"\">\n<img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/hack.gpl.jp\/wp-content\/uploads\/2020\/09\/abata.png\" width=\"96\" height=\"96\" alt=\"\u3058\u3083\u3093\u304f\u306f\u3063\u304f\" class=\"w_b_ava_img w_b_w100 w_b_h100  w_b_mp0 w_b_img\" style=\"\" \/>\n<\/div><\/div><\/div><div class=\"w_b_name w_b_w100 w_b_lh w_b_name_C w_b_ta_C w_b_mp0 w_b_div\">\u3058\u3083\u3093\u304f\u306f\u3063\u304f<\/div><\/div><div class=\"w_b_bal_box w_b_bal_L w_b_relative w_b_direction_L w_b_w100 w_b_div\"><div class=\"w_b_space w_b_mp0 w_b_div\"><svg version=\"1.1\" xmlns=\"http:\/\/www.w3.org\/2000\/svg\" xmlns:xlink=\"http:\/\/www.w3.org\/1999\/xlink\" x=\"0px\" y=\"0px\" width=\"1\" height=\"38\" viewBox=\"0 0 1 1\" fill=\"transparent\" stroke=\"transparent\" stroke-miterlimit=\"10\" class=\"w_b_db w_b_mp0\"><polygon fill=\"transparent\" stroke=\"transparent\" points=\"0,1 0,1 0,1 0,1 \"\/><\/svg><\/div><div class=\"w_b_bal_outer w_b_flex w_b_mp0 w_b_relative w_b_div\" style=\"\"><div class=\"w_b_bal_wrap w_b_bal_wrap_L w_b_div\"><div class=\"w_b_bal w_b_relative w_b_talk w_b_talk_L w_b_shadow_L w_b_ta_L w_b_div\"><div class=\"w_b_quote w_b_div\">\n\u7d50\u8ad6\uff1a2024\u5e7410\u6708\u73fe\u5728\u3067\u30d7\u30ed\u30b0\u30e9\u30df\u30f3\u30b0\u306e\u30ef\u30fc\u30af\u30d5\u30ed\u30fc\u306f\u5909\u308f\u308a\u3064\u3064\u3042\u308b\uff01\u3053\u308c\u3092\u77e5\u3089\u306a\u3044\u306e\u3068\u3001\u77e5\u3063\u3066\u308b\u306e\u3068\u3067\u306f\u5927\u9055\u3044\u3068\u3044\u3046\u3053\u3068\u304c\u308f\u304b\u308a\u307e\u3057\u305f\u3002\n<\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div>\n\n<h2>\u3053\u306e\u8a18\u4e8b\u306e\u6982\u8981<\/h2>\n<ul>\n<li>VScode\u7d4c\u7531\u3067\u3001AI\u306b\u304a\u9858\u3044\u3057\u3066\u81ea\u7136\u8a00\u8a9e\uff08\u65e5\u672c\u8a9e\uff09\u3067\u96fb\u5353\u3092\u4f5c\u3063\u305f<\/li>\n<li>\u4f5c\u3063\u305f\u306e\u306fNext.js\u3067\u52d5\u4f5c\u3059\u308bWEB\u30a2\u30d7\u30ea<\/li>\n<li>\u305d\u306e\u4f5c\u308a\u65b9\u306e\u5177\u4f53\u4f8b<\/li>\n<li>\u30b7\u30fc\u30b1\u30f3\u30b9\u56f3\u3084\u30d5\u30ed\u30fc\u30c1\u30e3\u30fc\u30c8\u3084\u4ed5\u69d8\u66f8\u306a\u3069\u3082\u826f\u3044\u3082\u306e\u3092\u4f5c\u3063\u3066\u304f\u308c\u307e\u3059<\/li>\n<\/ul>\n<h2>AI\u306b\u304a\u9858\u3044\u3057\u3066\u4f5c\u3063\u305f\u3082\u306e<\/h2>\n<p>\u3000\u4f55\u3092\u4f5c\u3063\u305f\u306e\u304b\u3068\u3044\u3046\u3068\u3001\u305d\u308c\u306fmacOS\u306e\u4ed8\u5c5e\u3059\u308b\u96fb\u5353\u30a2\u30d7\u30ea\u306e\u30ab\u30e9\u30fc\u30ea\u30f3\u30b0\u306b\u4f3c\u305fWEB\u30a2\u30d7\u30ea\u306e\u96fb\u5353\u3067\u3059\u3002\u50d5\u81ea\u8eab\u304c\u307b\u307c\u77e5\u3089\u306a\u3044Next.js\u306e\u30d5\u30ec\u30fc\u30e0\u30ef\u30fc\u30af\u3092\u4f7f\u3063\u3066AI\u306b\u4f5c\u3063\u3066\u3082\u3089\u3046\u3053\u3068\u3092\u76ee\u6a19\u306b\u3057\u305f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u3059\u3002AI\u304c\u4f5c\u3063\u305f\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u306f\u4ee5\u4e0b\u306b\u3042\u308a\u307e\u3059\u3002<\/p>\n<center>\n  <img decoding=\"async\" src=\"https:\/\/hack.gpl.jp\/wp-content\/uploads\/2024\/10\/macos-calc-clone2.png\" alt=\"macOS clone2 \u96fb\u5353\u30a2\u30d7\u30ea\">\n<\/center>\n<ul>\n<li>macos clone calc2\uff1a<a href=\"https:\/\/github.com\/ishizaka0\/macos_calc_clone2\">https:\/\/github.com\/ishizaka0\/macos_calc_clone2<\/a><\/li>\n<li>\u52d5\u4f5c\u30c7\u30e2\uff1a<a href=\"https:\/\/macos-calc-clone2.vercel.app\/\">https:\/\/macos-calc-clone2.vercel.app\/<\/a><\/li>\n<\/ul>\n<p>\u307e\u305f\u3001GITHUB\u306b\u3042\u308breadme.md \u306e\u4ed5\u69d8\u66f8\u3082AI\u306b\u4f5c\u3063\u3066\u3082\u3089\u3044\u307e\u3057\u305f\u3002\u3073\u3063\u304f\u308a\u3057\u305f\u306e\u306f\u3001\u30b7\u30fc\u30b1\u30f3\u30b9\u56f3\u3084\u30d5\u30ed\u30fc\u30c1\u30e3\u30fc\u30c8\u306a\u3093\u304b\u66f8\u3051\u306a\u3044\u3060\u308d\u3046\u306a\uff01\u3063\u3066\u601d\u3063\u3066\u3044\u305f\u306e\u3067\u3059\u304c\u3001\u4f9d\u983c\u3057\u305f\u3089\u4f5c\u3063\u3066\u304f\u308c\u307e\u3057\u305f\u3002GITHUB\u306b\u3042\u308b\u56f3\u306f\u307e\u3063\u305f\u304f\u3001\u52a0\u5de5\u3057\u3066\u3044\u307e\u305b\u3093\u3002\u3073\u3063\u304f\u308a\u3067\u3059\u3088\u306d\uff01\u30b7\u30fc\u30b1\u30f3\u30b9\u56f3\u3092\u3053\u3061\u3089\u306b\u3082\u8f09\u305b\u3066\u304a\u304d\u307e\u3059\u3002<\/p>\n<pre><code class=\"language-mermaid\">sequenceDiagram\n    participant User as \u30e6\u30fc\u30b6\u30fc\n    participant CalculatorApp as \u96fb\u5353\u30a2\u30d7\u30ea\n    participant Display as \u8868\u793a\u90e8\n    participant Clipboard as \u30af\u30ea\u30c3\u30d7\u30dc\u30fc\u30c9\n\n    User-&gt;&gt;CalculatorApp: \u30dc\u30bf\u30f3\u307e\u305f\u306f\u30ad\u30fc\u30dc\u30fc\u30c9\u3067\u5165\u529b\n    CalculatorApp-&gt;&gt;Display: \u5165\u529b\u5024\u3092\u66f4\u65b0\n    Note right of Display: displayValue\u3092\u66f4\u65b0\n\n    User-&gt;&gt;CalculatorApp: \"=\"\u30ad\u30fc\u3092\u62bc\u4e0b\n    CalculatorApp-&gt;&gt;CalculatorApp: \u8a08\u7b97\u5f0f\u3092\u7d44\u307f\u7acb\u3066\n    CalculatorApp-&gt;&gt;CalculatorApp: evaluateExpression\u95a2\u6570\u3092\u547c\u3073\u51fa\u3057\n    CalculatorApp--&gt;&gt;Display: \u8a08\u7b97\u7d50\u679c\u3092\u8868\u793a\n    CalculatorApp-&gt;&gt;CalculatorApp: \u5c65\u6b74\u3092\u66f4\u65b0\n\n    User-&gt;&gt;CalculatorApp: \"COPY\"\u30dc\u30bf\u30f3\u3092\u62bc\u4e0b\n    CalculatorApp-&gt;&gt;Clipboard: \u8a08\u7b97\u7d50\u679c\u3092\u30b3\u30d4\u30fc\n\n    User-&gt;&gt;CalculatorApp: \u5916\u90e8\u304b\u3089\u6570\u5b57\u3092\u30da\u30fc\u30b9\u30c8\n    Clipboard--&gt;&gt;CalculatorApp: \u6570\u5b57\u3092\u8cbc\u308a\u4ed8\u3051\n    CalculatorApp-&gt;&gt;Display: displayValue\u3092\u66f4\u65b0<\/code><\/pre>\n<h2>\u4f5c\u308a\u65b9\u30fb\u6982\u8981<\/h2>\n<p>\u3055\u3066\u3001\u3067\u306f\u3069\u3046\u3044\u3046\u3082\u306e\u3092\u7528\u610f\u3059\u308c\u3070\u826f\u3044\u306e\u3067\u3057\u3087\u3046\u304b\uff1f\u3000\u305d\u308c\u306f\u7c21\u5358\u3067\u4ee5\u4e0b\u3092\u7528\u610f\u3059\u308c\u3070\u826f\u3044\u3067\u3059\u3002<\/p>\n<ul>\n<li>OpenAI\u306a\u3069AI\u30b5\u30fc\u30d3\u30b9\u30d7\u30ed\u30d0\u30a4\u30c0\u306eAPI KEY<\/li>\n<li>VScode<\/li>\n<li>\u305d\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u306eCLINE\uff1a<a href=\"https:\/\/marketplace.visualstudio.com\/items?itemName=saoudrizwan.claude-dev\" title=\"LINK\">LINK<\/a><\/li>\n<\/ul>\n<center>\n\n<img decoding=\"async\" src=\"https:\/\/hack.gpl.jp\/wp-content\/uploads\/2024\/10\/cline.png\">\n\n<\/center>\n<p>\u3053\u308c\u3060\u3051\u3067\u3059\u3002<\/p>\n<h2>\u4f5c\u308a\u65b9<\/h2>\n<p>\u3044\u304d\u306a\u308a\u4f5c\u308a\u59cb\u3081\u3066\u3082\u826f\u3044\u306e\u3067\u3059\u304c\u3001\u5b8c\u6210\u5ea6\u3092\u6c42\u3081\u308b\u5834\u5408\u306f\u3001\u4ed5\u69d8\u66f8\u3092\u4f5c\u308b\u3053\u3068\u3092\u304a\u52e7\u3081\u3044\u305f\u3057\u307e\u3059\u3002\u305f\u3068\u3048\u3070\u3001git\u306eREADME.md\u3068\u3001macos\u306e\u96fb\u5353\u306e\u30b9\u30af\u30b7\u30e7\u3060\u3051Local\u306e\u9069\u5f53\u306a\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306b\u30b3\u30d4\u30fc\u3057\u3066\u3001\u305d\u306e\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092VScode\u3067\u958b\u304d\u307e\u3059\u3002<\/p>\n<p>\u305d\u3057\u3066\u3001CLINE\u3067\u4ee5\u4e0b\u306e\u3088\u3046\u306b\u304a\u9858\u3044\u3059\u308b\u3060\u3051\u3067\u3059\u3002<\/p>\n<blockquote>\nREADME.md \u306e\u4ed5\u69d8\u3092\u5143\u306bNext.js \u3067\u96fb\u5353\u3092\u4f5c\u3063\u3066\u304f\u3060\u3055\u3044\u3002\u6dfb\u4ed8\u753b\u50cf\u3001ss.png \u3082\u53c2\u8003\u306b\u3057\u3066\u3002\n<\/blockquote>\n<center>\n\n<img decoding=\"async\" src=\"https:\/\/hack.gpl.jp\/wp-content\/uploads\/2024\/10\/cline_demo.png\">\n\n<\/center>\n<p>\u753b\u50cf\u306f\u3001\u30ab\u30e1\u30e9\u30a2\u30a4\u30b3\u30f3\u304b\u3089\u6dfb\u4ed8\u3067\u304d\u307e\u3059\u3002\u3059\u308b\u3068\u3001<code>npx create-next-app@latest calculator-app<\/code>\u306a\u3069\u5fc5\u8981\u306a\u30b3\u30de\u30f3\u30c9\u306a\u3069\u3092\u3001<code>Run Command<\/code>\u3059\u308b\u3060\u3051\u3067\u3059\u3002\u753b\u50cf\u306f\uff11\u3064\u9032\u3093\u3060\u72b6\u614b\u3067\u3059\u3002\u305f\u3068\u3048\u3070\u3001\u30a8\u30e9\u30fc\u306a\u3069\u304c\u8d77\u304d\u3066\u3082\u305d\u308c\u3092\u518d\u5ea6\u3001AI\u304c\u5224\u65ad\u3057\u89e3\u6c7a\u7b56\u3092\u30b3\u30de\u30f3\u30c9\u306a\u308a\u3092\u6559\u3048\u3066\u304f\u308c\u307e\u3059\u3002\u3084\u3070\u3044\u3067\u3059\u3088\u306d\uff01<\/p>\n<p>\u305d\u3057\u3066\u3001\u4ee5\u4e0b\u306e\u30b9\u30af\u30b7\u30e7\u3067\u306f<code>page.tsx<\/code>\u3092AI\u304c\u66f8\u3044\u3066\u304f\u308c\u3066\u4eba\u9593\u306f<code>Save<\/code>\u30dc\u30bf\u30f3\u3092\u62bc\u3059\u3060\u3051\u3067\u3059\u3002\u3075\u3041\u30fc\uff01\u3000\u3053\u306e\u6642\u70b9\u3067\u50d5\u306f\u3076\u3063\u5012\u308c\u305d\u3046\u306b\u306a\u308a\u307e\u3057\u305f\u3002<\/p>\n<center>\n\n<img decoding=\"async\" src=\"https:\/\/hack.gpl.jp\/wp-content\/uploads\/2024\/10\/vscode_ss2.png\">\n\n<\/center>\n<p>\u5b9f\u969b\u306b\u4f5c\u308a\u8fbc\u3093\u3067\u3044\u304f\u904e\u7a0b\u3067\u306f\u3001\u6307\u793a\u306e\u4ed5\u65b9\u304c\u91cd\u8981\u3067\u3059\u3002<\/p>\n<h2>\u4f5c\u308b\u3068\u304d\u306e\u30b3\u30c4<\/h2>\n<p>\u3084\u3063\u3066\u307f\u308b\u3068\u308f\u304b\u308a\u307e\u3059\u304c\u3001\u6307\u793a\u306e\u4e0e\u3048\u65b9\u3001\u3064\u307e\u308a\u304a\u9858\u3044\u306e\u4ed5\u65b9\u304c\u30dd\u30a4\u30f3\u30c8\u3067\u3059\u3002\n\u6642\u306b\u306f\u3001\u7121\u9650\u30eb\u30fc\u30d7\u3063\u307d\u304f\u306a\u308b\u3068\u304d\u3082\u3042\u308a\u307e\u3059\u3002\u305d\u3046\u3044\u3046\u6642\u306f\u3001\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u3092\u5168\u90e81\u679a\u306e\u30c6\u30ad\u30b9\u30c8\u4e0a\u306b\u3057\u3066\u3001WEB\u7248\u306eChatGPT\u306eo1\u306b\u89e3\u6c7a\u3057\u3066\u3082\u3089\u3044\u307e\u3059\u3002\u305d\u3057\u3066\u3001\u305d\u306e\u6307\u793a\u3084\u3001\u4fee\u6b63\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u3092CLINE\u3067\u6295\u3052\u308b\u3053\u3068\u306b\u3088\u308a\u3001\u307b\u307c\u5168\u3066\u89e3\u6c7a\u3067\u304d\u307e\u3057\u305f\u3002\nCLINE\u3067o1\u306b\u6295\u3052\u308b\u3068\u3001\u30b3\u30f3\u30c6\u30f3\u30c4\u304c\u9577\u3044\u3063\u3066\u6012\u3089\u308c\u307e\u3059\u306e\u3067WEB\u7248\u3092\u4f7f\u3044\u307e\u3057\u305f\u3002<\/p>\n<p>\u307e\u305f\u3001UI\u3092\u4f5c\u308b\u6642\u306f\u3001v0 \u306e\u65b9\u304c\u3088\u308a\u826f\u3044UI\u30c7\u30b6\u30a4\u30f3\u3092\u4f5c\u3063\u3066\u304f\u308c\u307e\u3059\u3002\u3042\u3068\u3001\u5b9f\u969b\u306e\u958b\u767a\u30d5\u30ed\u30fc\u306e\u3088\u3046\u306bGIT\u3067\u7ba1\u7406\u3057\u3066\u3001ISSUE\u3092\u4f5c\u308a\u30d5\u30e5\u30fc\u30c1\u30e3\u30fc\u30d6\u30e9\u30f3\u30c1\u3092\u5207\u308a\u306a\u304c\u3089\u3001\u9032\u3081\u308b\u3068\u3088\u308a\u3069\u3053\u306b\u554f\u984c\u304c\u3042\u3063\u3066\u3001\u3069\u3046\u3044\u3046\u30b3\u30fc\u30c9\u304c\u66f8\u304b\u308c\u3066\u3001AI\u304c\u3069\u3053\u3067\u9593\u9055\u3063\u3066\u3044\u308b\u306e\u304b\u306e\u539f\u56e0\u3092\u63a2\u308b\u6642\u306b\u52b9\u679c\u7684\u3067\u3059\u3002<\/p>\n<h2>AI\u30d7\u30ed\u30d0\u30a4\u30c0\u306b\u3064\u3044\u3066<\/h2>\n<p>CLINE\u3067\u6307\u5b9a\u3067\u304d\u308b\u30d7\u30ed\u30d0\u30a4\u30c0\u306f\u3001\u3044\u308d\u3044\u308d\u3042\u308a\u307e\u3059\u3002ChatGPT\u306eo1\u306fAPI\u7d4c\u7531\u3067\u306f\u4f7f\u3048\u306a\u3044\u3088\u3046\u306a\u306e\u3067\u3001mistral.ai\u306e<code>Codestral<\/code>\u3068\u3044\u3046\u306e\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u308c\u3092\u4f7f\u3044\u305f\u3044\u6642\u306f\u3001API\u30ad\u30fc\u3092\u767a\u884c\u3057\u3066\u3001CLINE\u306e<code>OpenAI Compatible<\/code> \u3067\u4f7f\u3048\u308b\u304b\u306a\u3068\u8a66\u3057\u305f\u306e\u3067\u3059\u304c\u3001\u3046\u307e\u304f\u3044\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u4ee5\u4e0b\u3092\u5165\u308c\u3066\u30d7\u30ed\u30ad\u30b7\u30fc\u7d4c\u7531\u3067\u4f7f\u3048\u3070\u56de\u907f\u3067\u304d\u308b\u307f\u305f\u3044\u3067\u3057\u305f\u3002<\/p>\n<pre><code>pip3 install litellm\npip3 install &amp;#039;litellm[proxy]&amp;#039;<\/code><\/pre>\n<ul>\n<li>API\u30ad\u30fc\u767a\u884c\u3057\u3066\u304a\u3044\u3066\u304f\u3060\u3055\u3044\uff1a<a href=\"https:\/\/mistral.ai\/news\/codestral-mamba\/\">https:\/\/mistral.ai\/news\/codestral-mamba\/<\/a><\/li>\n<\/ul>\n<pre><code>export MISTRAL_API_KEY=\u53d6\u5f97\u3057\u305fAPI\u30ad\u30fc\u3092\nexport CODESTRAL_API_KEY=\u3053\u308c\u306eAPI\u30ad\u30fc\u306f\u5225\u306e\u3088\u3046\u3067\u3059\u3002\u53d6\u5f97\u3057\u305fAPI\u30ad\u30fc\u3092\nlitellm --model mistral\/mistral-large-latest<\/code><\/pre>\n<p>CLINE\u5074\u306b\u306f\u4ee5\u4e0b\u306e\u3088\u3046\u306b\u8a2d\u5b9a\u3057\u307e\u3059\u3002<\/p>\n<img decoding=\"async\" src=\"https:\/\/hack.gpl.jp\/wp-content\/uploads\/2024\/10\/1111.png\" alt=\"\" \/>\n<p>\u7121\u6599\u7248\u3060\u3068\u3001\u30ec\u30fc\u30c8\u5236\u9650\u304c\u4f4e\u304b\u3063\u305f\u308a\u3001\u30c7\u30fc\u30bf\u304c\u975e\u516c\u958b\u3058\u3083\u306a\u304b\u3063\u305f\u308a\u3001\u30ab\u30b9\u30bf\u30e0\u30e2\u30c7\u30eb\u304c\u4f7f\u3048\u306a\u304b\u3063\u305f\u308a\u3068\u5236\u9650\u304c\u3042\u308a\u307e\u3059\u306e\u3067\u3001\u3088\u3055\u305d\u3046\u3067\u3042\u308c\u3070\u6709\u6599\u30d7\u30e9\u30f3\u3082\u8003\u3048\u3066\u3044\u307e\u3059\u3002<\/p>\n<img decoding=\"async\" src=\"https:\/\/hack.gpl.jp\/wp-content\/uploads\/2024\/10\/mistral_ai.png\" alt=\"\" \/>\n<h2>\u307e\u3068\u3081<\/h2>\n<p>\u4eca\u56de\u306a\u3093\u3068\u306a\u304f\u308f\u304b\u3063\u305f\u3053\u3068<\/p>\n<ul>\n<li>VScode\u304b\u3089\u3001CLINE\u30d7\u30e9\u30b0\u30a4\u30f3\u3092\u7d4c\u7531\u3057API\u7d4c\u7531\u3067\u4f7f\u3046<\/li>\n<li>\u4ed5\u69d8\u66f8\u306f\u5fc5\u305a\u66f8\u304f\u3079\u304d\u3002\u9762\u5012\u306a\u6642\u306f\u3042\u3068\u304b\u3089\u3001\u30bd\u30fc\u30b9\u30b3\u30fc\u30c9\u306e\u30ed\u30b8\u30c3\u30af\u3092\u8ffd\u3063\u3066\u66f8\u3044\u3066\u304a\u304f<\/li>\n<li>\u8981\u6c42\u4ed5\u69d8\u306f\u3001\u5e73\u305f\u304f\u8a00\u3048\u3070\u30a2\u30b8\u30e3\u30a4\u30eb\u958b\u767a\u3059\u308b\u3068\u304d\u306e\u3001\u30e6\u30fc\u30b6\u30fc\u76ee\u7dda\u306e\u3084\u308c\u308b\u3053\u3068\u3092\u6587\u7ae0\u5316\u3059\u308b\u3053\u3068\u304c\u5927\u5207<\/li>\n<li>\u30b7\u30b9\u30c6\u30e0\u30d7\u30ed\u30f3\u30d7\u30c8\u306b\u3082\u3001\u7d76\u5bfe\u5b88\u3063\u3066\u307b\u3057\u3044\u30eb\u30fc\u30eb\u306f\u66f8\u3044\u3066\u304a\u304f\u3068\u826f\u3044<\/li>\n<li>AI\u306b\u304a\u9858\u3044\u3059\u308b\u3068\u304d\u306f\u3001\u5177\u4f53\u7684\u306b\u304a\u9858\u3044\u3059\u308b<\/li>\n<li>CLINE\u306eAI\u306b\u304a\u9858\u3044\u3059\u308b\u3068\u304d\u3001\u304a\u9858\u3044\u306e\u4ed5\u65b9\u3092\u3088\u308a\u982d\u306e\u826f\u3044AI\u3067\u3042\u308bo1\u306b\u4f9d\u983c\u3059\u308b<\/li>\n<li>\u5b9f\u969b\u306e\u958b\u767a\u306e\u30ef\u30fc\u30af\u30d5\u30ed\u30fc\u3068\u540c\u3058\u3088\u3046\u306b\u3059\u308b\u3053\u3068\u3067\u3001\u554f\u984c\u304c\u3069\u3053\u306b\u3042\u308b\u304b\u9855\u5728\u5316\u3059\u308b\u3053\u3068\u304c\u53ef\u80fd<\/li>\n<li>Bug\u304c\u53d6\u308c\u306a\u3044\u6642\u306f\u3001ChatGPT\u306eo1\u306a\u3069\u3001IQ\u306e\u9ad8\u3044AI\u306b\u89e3\u6c7a\u3057\u3066\u3082\u3089\u3046<\/li>\n<li>git\u306a\u3069\u3067AI\u306e\u5909\u66f4\u5c65\u6b74\u3092\u4fdd\u5b58\u3057\u3001\u65b9\u5411\u6027\u304c\u60aa\u304f\u306a\u3063\u305f\u3089\u5143\u306b\u623b\u305b\u308b\u3088\u3046\u306b\u3057\u3066\u304a\u304f<\/li>\n<li>\u6307\u793a\u3092\u4e0e\u3048\u308b\u4eba\u9593\u304c\u554f\u984c\u306e\u6839\u672c\u3092\u7406\u89e3\u3057\u3066\u3044\u306a\u3044\u3068\u3001\u3046\u307e\u304f\u89e3\u6c7a\u3067\u304d\u306a\u3044\u306e\u3067\u307e\u305a\u305d\u3053\u3092\u7406\u89e3\u3057\u3066\u304b\u3089AI\u306b\u6307\u793a\u3092\u4e0e\u3048\u308b<\/li>\n<\/ul>\n<h2>\u3042\u3068\u304c\u304d<\/h2>\n<p>ChatGPT\u304c\u767a\u8868\u3055\u308c\u305f\u306e\u306f\u30012022\u5e7411\u670830\u65e5\u3067\u3059\u3002\u4eca\u306f2024\u5e7410\u6708\u3067\u3059\u304b\u3089\u6765\u6708\u306e30\u306b\u304c\u304f\u308b\u3068\u4e382\u5e74\u306b\u306a\u308b\u308f\u3051\u3067\u3059\u306d\u3002\n\u3000\u305d\u3057\u3066\u3001\u50d5\u3089\u30a8\u30f3\u30b8\u30cb\u30a2\u696d\u754c\u306e\u30ef\u30fc\u30af\u30d5\u30ed\u30fc\u3082\u5909\u308f\u308a\u3064\u3064\u3042\u308a\u307e\u3059\u3002\u307e\u3060\u3001\u3053\u308c\u306b\u6c17\u304c\u3064\u3044\u3066\u3044\u306a\u3044\u30a8\u30f3\u30b8\u30cb\u30a2\u3082\u3044\u307e\u3059\u304c\u3001\u50d5\u306f\u3053\u308c\u3089\u306e\u4f53\u9a13\u306b\u3088\u3063\u3066\u4eca\u5f8c\u306e\u4ed5\u4e8b\u3067\u4f55\u304c\u5927\u5207\u306a\u306e\u304b\u3092\u6539\u3081\u3066\u8003\u3048\u3055\u305b\u3089\u308c\u307e\u3057\u305f\u3002\n\u7d50\u5c40\u3001AI\u306e\u307b\u3046\u304c\u5e83\u7bc4\u56f2\u306b\u3044\u308d\u3093\u306a\u77e5\u8b58\u3092\u77e5\u3063\u3066\u3044\u3066\u982d\u304c\u826f\u3044\u308f\u3051\u3067\u3001\u7d30\u304b\u306a\u69cb\u6587\u3084\u3001\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u4f9d\u5b58\u95a2\u4fc2\u306a\u3069\u305d\u3046\u3044\u3046\u90e8\u5206\u306fAI\u306b\u4efb\u305b\u308c\u3070\u826f\u3044\u3067\u3059\u3002\u3057\u304b\u3057\u3001\u4e00\u756a\u91cd\u8981\u306a\u306e\u306f\u305d\u308c\u4ee5\u5916\u306e\u4eba\u9593\u3067\u3057\u304b\u6c7a\u3081\u3089\u308c\u306a\u3044\u30a2\u30d7\u30ea\u306e\u65b9\u5411\u6027\u3084\u3001\u5927\u5207\u306b\u3057\u305f\u3044\u90e8\u5206\u3002\u3053\u308c\u306f\u6307\u793a\u3092\u4e0e\u3048\u308b\u4eba\u9593\u304c\u3057\u3063\u304b\u308a\u3068\u65b9\u5411\u3068\u65b9\u91dd\u3092\u56fa\u3081\u3066\u304a\u304b\u306a\u3044\u3068\u826f\u3044\u3082\u306e\u306f\u4f5c\u308c\u306a\u3044\u306a\uff01\u3068\u611f\u3058\u307e\u3057\u305f\u3002<\/p>\n<p>\u307e\u305f\u3001\u3053\u3053\u306b\u306f\u66f8\u304d\u304d\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u304c\u3001\u4ee5\u4e0b\u306e\u30a2\u30d7\u30ea\u3082\u4f5c\u308c\u308b\u3053\u3068\u3092\u78ba\u8a8d\u6e08\u307f\u3067\u3059\u3002\u3068\u306b\u304b\u304f\u3001\u3072\u3068\u6614\u524d\uff08\u3068\u3044\u3063\u3066\u30821\u5e74\u524d\u304f\u3089\u3044\u3067\u3059\u304c\uff09\u306f\u3053\u3093\u306a\u30ef\u30fc\u30af\u30d5\u30ed\u30fc\u304c\u4f5c\u308c\u308b\u306a\u3093\u3066\u5922\u306b\u3082\u601d\u3063\u3066\u3044\u307e\u305b\u3093\u3067\u3057\u305f\u3002<\/p>\n<ul>\n<li>\u3053\u308c\u4ee5\u5916\u306b\u3082Android\u30cd\u30a4\u30c6\u30a3\u30d6\u30a2\u30d7\u30ea\u3092\u30d3\u30eb\u30c9\u3057\u305f<\/li>\n<li>Auth\u8a8d\u8a3c\u306e\u9762\u5012\u306a\u306e\u3082\u4f5c\u308c\u307e\u3059<\/li>\n<li>macOS\u3084Windows\u30cd\u30a4\u30c6\u30a3\u30d6\u30a2\u30d7\u30ea\u3082\u4f5c\u308a\u59cb\u3081\u3066\u3044\u307e\u3059<\/li>\n<\/ul>\n<p>\u3068\u3093\u3067\u3082\u306a\u3044\u4e16\u306e\u4e2d\u306b\u306a\u3063\u305f\u3082\u3093\u3067\u3059\u3002\u3042\u308b\u610f\u5473\u3001\u5927\u30c1\u30e3\u30f3\u30b9\u5230\u6765\u3068\u3044\u3063\u305f\u3068\u3053\u308d\u3067\u3057\u3087\u3046\u304b\u3002\u30d7\u30ed\u30b0\u30e9\u30e0\u30df\u30f3\u30b0\u306e\u52c9\u5f37\u3082\u3001AI\u3068\u4e00\u7dd2\u306b\u3084\u308c\u3070\u3088\u308a\u3001\u6df1\u304f\u5b66\u7fd2\u3067\u304d\u307e\u3059\u3057\u3002\n\uff11\u3064\u3060\u3051\u3001\u61f8\u5ff5\u304c\u3042\u308a\u307e\u3059\u3002\u305d\u308c\u306fAI\u304c\u81ea\u5f8b\u7684\u306b\u52d5\u3051\u308b\u3088\u3046\u306b\u306a\u3063\u305f\u3068\u304d\u3001OS\u306e\u30ab\u30fc\u30cd\u30eb\u306bAI\u6a5f\u80fd\u3092\u7d71\u5408\u3057\u3066\u3057\u307e\u3046\u6050\u308c\u304c\u3042\u308b\u3053\u3068\u3067\u3059\u3002\u3059\u3054\u304f\u5805\u9663\u306aOS\u304c\u3067\u304d\u308b\u53cd\u9762\u3001\u4f7f\u3044\u65b9\u3092\u8aa4\u308b\u3068\u3084\u3070\u3044\u7528\u9014\u306b\u3082\u4f7f\u308f\u308c\u308b\u3053\u3068\u306b\u306a\u308a\u307e\u3059\u3002\u826f\u3044\u672a\u6765\u306b\u3057\u305f\u3044\u3082\u306e\u3067\u3059\u306d\u3002<\/p>\n\n<h3 class=\"wp-block-heading\">\u8457\u8005\u306b\u30e1\u30c3\u30bb\u30fc\u30b8<\/h3>\n\n\n\n<p>\u9593\u9055\u3044\u306e\u3054\u6307\u6458\u306a\u3069\u3001\u30b3\u30e1\u30f3\u30c8\u3058\u3083\u306a\u304f\u3066\u3001\u500b\u4eba\u7684\u306b\u3084\u308a\u3068\u308a\u3057\u305f\u3044\u5834\u5408\u306f<a class=\"c-link-text\" href=\"https:\/\/hack.gpl.jp\/mail\/\" target=\"_blank\" rel=\"noopener\">\u3053\u3061\u3089\u304b\u3089<\/a>\u3069\u3046\u305e\u3002\u304a\u8fd4\u4e8b\u304c\u9045\u304f\u306a\u308b\u3068\u304d\u3082\u3042\u308a\u307e\u3059\u304c\u3001\u3054\u4e86\u627f\u3092\u3002<\/p>\n","protected":false},"excerpt":{"rendered":"<p>\u3053\u306e\u8a18\u4e8b\u306e\u6982\u8981 VScode\u7d4c\u7531\u3067\u3001AI\u306b\u304a\u9858\u3044\u3057\u3066\u81ea\u7136\u8a00\u8a9e\uff08\u65e5\u672c\u8a9e\uff09\u3067\u96fb\u5353\u3092\u4f5c\u3063\u305f \u4f5c\u3063\u305f\u306e\u306fNext.js\u3067\u52d5\u4f5c\u3059\u308bWEB\u30a2\u30d7\u30ea \u305d\u306e\u4f5c\u308a\u65b9\u306e\u5177\u4f53\u4f8b \u30b7\u30fc\u30b1\u30f3\u30b9\u56f3\u3084\u30d5\u30ed\u30fc\u30c1\u30e3\u30fc\u30c8\u3084\u4ed5\u69d8\u66f8\u306a\u3069\u3082\u826f\u3044\u3082\u306e\u3092\u4f5c\u3063\u3066\u304f\u308c\u307e\u3059 [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":11259,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"_uag_custom_page_level_css":"","footnotes":""},"categories":[8,47,83],"tags":[],"class_list":["post-11771","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-android","category-linux","category-wordpress"],"acf":[],"uagb_featured_image_src":{"full":["https:\/\/hack.gpl.jp\/wp-content\/uploads\/2022\/05\/gogai.png",800,800,false],"thumbnail":["https:\/\/hack.gpl.jp\/wp-content\/uploads\/2022\/05\/gogai.png",96,96,false],"medium":["https:\/\/hack.gpl.jp\/wp-content\/uploads\/2022\/05\/gogai.png",800,800,false],"medium_large":["https:\/\/hack.gpl.jp\/wp-content\/uploads\/2022\/05\/gogai-768x768.png",768,768,true],"large":["https:\/\/hack.gpl.jp\/wp-content\/uploads\/2022\/05\/gogai.png",800,800,false],"1536x1536":["https:\/\/hack.gpl.jp\/wp-content\/uploads\/2022\/05\/gogai.png",800,800,false],"2048x2048":["https:\/\/hack.gpl.jp\/wp-content\/uploads\/2022\/05\/gogai.png",800,800,false],"post-thumbnail":["https:\/\/hack.gpl.jp\/wp-content\/uploads\/2022\/05\/gogai.png",800,800,false]},"uagb_author_info":{"display_name":"JunkHack","author_link":"https:\/\/hack.gpl.jp\/author\/junkhack\/"},"uagb_comment_info":0,"uagb_excerpt":"\u3053\u306e\u8a18\u4e8b\u306e\u6982\u8981 VScode\u7d4c\u7531\u3067\u3001AI\u306b\u304a\u9858\u3044\u3057\u3066\u81ea\u7136\u8a00\u8a9e\uff08\u65e5\u672c\u8a9e\uff09\u3067\u96fb\u5353\u3092\u4f5c\u3063\u305f \u4f5c\u3063\u305f\u306e\u306fNext.js&hellip;","_links":{"self":[{"href":"https:\/\/hack.gpl.jp\/wp-json\/wp\/v2\/posts\/11771"}],"collection":[{"href":"https:\/\/hack.gpl.jp\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/hack.gpl.jp\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/hack.gpl.jp\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/hack.gpl.jp\/wp-json\/wp\/v2\/comments?post=11771"}],"version-history":[{"count":0,"href":"https:\/\/hack.gpl.jp\/wp-json\/wp\/v2\/posts\/11771\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/hack.gpl.jp\/wp-json\/wp\/v2\/media\/11259"}],"wp:attachment":[{"href":"https:\/\/hack.gpl.jp\/wp-json\/wp\/v2\/media?parent=11771"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/hack.gpl.jp\/wp-json\/wp\/v2\/categories?post=11771"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/hack.gpl.jp\/wp-json\/wp\/v2\/tags?post=11771"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}